### Q) What is Pandas and it's use?

* Pandas is an open-source data manipulation and analysis library in Python. 

It's use:-

1) We can handle structure data in form of tables in pandas. 


2) We can perform many data manipulation and data analysis tasks using pandas, such as dropping column, checking the null values in the data and fill it, check the skewness of a particular variable, check data types of all columns and many more things we can perfrom using pandas library.


3) Pandas library is widely used in data science, finance, and many other fields for data analysis and data manipulation tasks.

### Q) What are the different data structures in Pandas?

The two main data structures in Pandas are the Series and the DataFrame.

* A Series is a one-dimensional array of data. Series is looks like a single column.


* A DataFrame is a two-dimensional array of data. Dataframe is looks like a table.

In [43]:
series = pd.Series([1, 2, 3, 4, 5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Q) What are the significant features of the Pandas library?

**High-performance data manipulation:** Pandas is very efficient at manipulating data.


**Easy-to-use data analysis tools:** Pandas provides a wide range of data analysis tools, making it easy to perform statistical analysis on data.


**Flexible data structures:** Pandas data structures are flexible and can be easily used to represent a variety of data types.
Widely used: Pandas is widely used by data scientists and machine learning engineers.

### Q) What are the advantages of using Pandas over other data analysis libraries?

* It is easy to use.


* It is fast.


* It is flexible,it means we can use variety of data types.


* It is widely used.

### Q) What are some of the limitations of Pandas?


**It can be memory-intensive:** Pandas data structures can be large, so it is important to be aware of memory usage when working with Pandas.


**It is not as powerful as some other data analysis libraries:** Pandas is not as powerful as some other data analysis libraries, such as R or MATLAB.


**It is not as well-suited for some tasks:** Pandas is not as well-suited for some tasks, such as machine learning, because it takes much time to train a model.

### Q) How would you use Pandas to solve a real-world problem?


* Data cleaning


* Data analysis


* Machine learning

### Q) What are some of the best practices for using Pandas?

**Use the right data structures:** Pandas has different data structures for different tasks. Use the right data structure for the task at hand.


**Be aware of memory usage:** Pandas data structures can be large, so it is important to be aware of memory usage when working with Pandas.


**Use the right tools:** Pandas has a variety of tools for different tasks. Use the right tools for the task at hand.


**Document your code:** Pandas code can be complex. Document your code to make it easier to understand and maintain.

### Q) How to create Dataframe in pandas?

In [1]:
# We can create Dataframe by using pd.DataFrame() Function. The code will be:-

import pandas as pd

df = pd.DataFrame({'Name':['Sameer','Faiz','Shuaib'], 'Age':[23,24,25]})
df

     Name  Age
0  Sameer   23
1    Faiz   24
2  Shuaib   25

In [2]:
df = pd.DataFrame({'Name': ['John', 'Emma', 'David', 'Sophia'],
        'Age': [25, 28, 31, 24],
        'City': ['New York', 'London', 'Paris', 'Sydney']})

df

     Name  Age      City
0    John   25  New York
1    Emma   28    London
2   David   31     Paris
3  Sophia   24    Sydney

### Q) How to import data in pandas?

Import pandas as pd

df = pd.read_csv(r'File_location/File_name.csv')

df.head()

### Q) How do you save a DataFrame to a CSV file using pandas?

In [41]:
df.to_csv('output.csv', index=False)

### Q) How do you rename columns in a DataFrame in pandas?

df = df.rename(columns={'old_column_name': 'new_column_name'})

### Q) How to select particular columns in pandas?

In [3]:
Columns = df[['Name','Age']]
Columns

     Name  Age
0    John   25
1    Emma   28
2   David   31
3  Sophia   24

### Q) How do you add a new column to an existing DataFrame?

In [50]:
df['new_column'] = [1, 2, 3, 4]
df

     Name  Age Sex   Address  Age_squared  Sum  new_column
0    John   25   M  Banglore          625  650           1
1    Emma   28   F   Chennai          784  812           2
2   David   31   M   Gurgaon          961  992           3
3  Sophia   24   F    Mumbai          576  600           4

### Q) What are the different ways to access columns in a pandas DataFrame?

In [4]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [5]:
df['Name']

0      John
1      Emma
2     David
3    Sophia
Name: Name, dtype: object

### Q) How do you handle missing values in a DataFrame using pandas?

In [6]:
# Check if values are missing

df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [7]:
# Drop rows with any missing values

df.dropna()

     Name  Age      City
0    John   25  New York
1    Emma   28    London
2   David   31     Paris
3  Sophia   24    Sydney

### Q) How do you filter rows in a DataFrame based on a condition in pandas?

In [8]:
filtered_df = df[df['Age'] > 25]
filtered_df

    Name  Age    City
1   Emma   28  London
2  David   31   Paris

### Q) How do you sort a DataFrame by a specific column in pandas?

In [9]:
#sort by ascending

sorted_df = df.sort_values('Age')
sorted_df

     Name  Age      City
3  Sophia   24    Sydney
0    John   25  New York
1    Emma   28    London
2   David   31     Paris

In [51]:
#sort by descending

sorted_df = df.sort_values('Age',ascending=False)
sorted_df

     Name  Age Sex   Address  Age_squared  Sum  new_column
2   David   31   M   Gurgaon          961  992           3
1    Emma   28   F   Chennai          784  812           2
0    John   25   M  Banglore          625  650           1
3  Sophia   24   F    Mumbai          576  600           4

### Q) You have a DataFrame in Pandas columns, how to make a new column between 2nd and 3rd column?


* We using df.insert() function and the code will be df.inseri(index no. of column, 'column name', variable of new column values).

In [10]:
# By using df.insert() function
# Format df.insert(index, 'new column name', Variable of new column values)

Sex = ['M', 'F', 'M', 'F']

df.insert(2, 'Sex', Sex)

df

     Name  Age Sex      City
0    John   25   M  New York
1    Emma   28   F    London
2   David   31   M     Paris
3  Sophia   24   F    Sydney

### Q) How to delete a column and add a new ones in it's index position?

In [11]:
df.drop('City',axis=1,inplace=True)

Location = ['delhi', 'mumbai', 'kolkata', 'chennai']

df.insert(3, 'Address', Location)

df

     Name  Age Sex  Address
0    John   25   M    delhi
1    Emma   28   F   mumbai
2   David   31   M  kolkata
3  Sophia   24   F  chennai

### Q) Add a new column with an address?

In [12]:
df['Address'] = ['Banglore', 'Chennai', 'Gurgaon', 'Mumbai']
df.head()

     Name  Age Sex   Address
0    John   25   M  Banglore
1    Emma   28   F   Chennai
2   David   31   M   Gurgaon
3  Sophia   24   F    Mumbai

### Q) Fetch the records where Age is greater than 26 and Sex is 'M'.

In [13]:
df[(df['Age']>26)&(df['Sex']=='M')]

    Name  Age Sex  Address
2  David   31   M  Gurgaon

### Q) How to rename a column?

In [14]:
df.rename(columns={'Sex':'Gender'})

     Name  Age Gender   Address
0    John   25      M  Banglore
1    Emma   28      F   Chennai
2   David   31      M   Gurgaon
3  Sophia   24      F    Mumbai

### Q) How to sort a dataframe?

In [15]:
df.sort_values(by="Name")

     Name  Age Sex   Address
2   David   31   M   Gurgaon
1    Emma   28   F   Chennai
0    John   25   M  Banglore
3  Sophia   24   F    Mumbai

### Q) How will you find the unique values for each column and subset of data for age>25 and age<30.

In [17]:
df['Name'].unique()

array(['John', 'Emma', 'David', 'Sophia'], dtype=object)

In [18]:
df['Name'].nunique()

4

In [19]:
a = df[(df['Age']>25) & (df['Age']<30)]
a

   Name  Age Sex  Address
1  Emma   28   F  Chennai

### Q) Find the statistical summary of dataframe and transpose it.

In [20]:
df.describe()

             Age
count   4.000000
mean   27.000000
std     3.162278
min    24.000000
25%    24.750000
50%    26.500000
75%    28.750000
max    31.000000

In [21]:
df.describe().T

     count  mean       std   min    25%   50%    75%   max
Age    4.0  27.0  3.162278  24.0  24.75  26.5  28.75  31.0

### Q) How to find the names of columns of a dataframe?

In [22]:
df.columns

Index(['Name', 'Age', 'Sex', 'Address'], dtype='object')

### Q) What is the difference between loc and iloc in pandas?



loc and iloc both function are used to select particular data from dataframe and we can perform filtering in loc function. In loc function columns and rows are selected by label indexing and in iloc function columns and rows are select by using integer indexing.

In [23]:
# Select rows and columns by labels

selected_data = df.loc[1:2, 'Name':'Age']
print(selected_data)

    Name  Age
1   Emma   28
2  David   31

In [46]:
# perform filtering

df.loc[df['Age'] >= 30]

    Name  Age Sex  Address  Age_squared  Sum
2  David   31   M  Gurgaon          961  992

In [24]:
# Select rows and columns by integer positions

selected_data = df.iloc[1:3, 0:2]
print(selected_data)

    Name  Age
1   Emma   28
2  David   31

### Q) How do you merge two DataFrames in pandas?

merged_df = pd.merge(df1, df2, on='column_name')

### Q) What is Pivot Table?

* Pivot table is a type of customize table where we can customize the index, columns and data inside the table by taking original data. It is use for data anlayis and data summarization. In pivot table we can perform aggregation functions, such as count, sum, mean and median, etc.

In [25]:
# Pivot the DataFrame

pivoted_df = df.pivot(index='Name', columns='Address', values=['Sex'])

print(pivoted_df)

             Sex
Address Banglore Chennai Gurgaon Mumbai
Name
David        NaN     NaN       M    NaN
Emma         NaN       F     NaN    NaN
John           M     NaN     NaN    NaN
Sophia       NaN     NaN     NaN      F

### Q) What is the use of groupby function?

The groupby() function in pandas is indeed used to group data or categories of one or more columns. It is commonly used for summarizing data and performing data analysis tasks. Additionally, you can perform aggregation functions on the categories of a column using the groupby function.

In [26]:
df.groupby('Name')['Address']

In [27]:
average_age = df['Age'].mean()
print(average_age)

27.0

### Q) How do you apply a function to a column or row in a DataFrame using pandas?
* In pandas, you can apply a function to a column or row in a DataFrame using the apply() function. The apply() function allows you to apply a function to each element, column, or row of a DataFrame.

In [28]:
# Define a function to apply
def square(x):
    return x**2

# Apply the function to a column using apply()
df['Age_squared'] = df['Age'].apply(square)
df

     Name  Age Sex   Address  Age_squared
0    John   25   M  Banglore          625
1    Emma   28   F   Chennai          784
2   David   31   M   Gurgaon          961
3  Sophia   24   F    Mumbai          576

In [29]:
# Apply the function to a row using apply() with axis=1
df['Sum'] = df.apply(lambda row: row['Age'] + row['Age_squared'], axis=1)
df

     Name  Age Sex   Address  Age_squared  Sum
0    John   25   M  Banglore          625  650
1    Emma   28   F   Chennai          784  812
2   David   31   M   Gurgaon          961  992
3  Sophia   24   F    Mumbai          576  600

### Q) How do you perform a left join, right join, inner join, and outer join in pandas?

In pandas, you can perform different types of joins between two DataFrames using the merge() function. The four common types of joins are left join, right join, inner join, and outer join. Here's how you can perform each type of join.

In [33]:
data = pd.DataFrame({'Name': ['John', 'Alice', 'Bob', 'Alice', 'John'],
        'Age': [25, 30, 35, 28, 22],
        'City': ['New York', 'London', 'Paris', 'London', 'New York'],
        'Salary': [50000, 60000, 70000, 55000, 45000]})
data

    Name  Age      City  Salary
0   John   25  New York   50000
1  Alice   30    London   60000
2    Bob   35     Paris   70000
3  Alice   28    London   55000
4   John   22  New York   45000

In [36]:
left_df = pd.merge(data,df, on='Age', how='left')
left_df

  Name_x  Age      City  Salary Name_y  Sex   Address  Age_squared    Sum
0   John   25  New York   50000   John    M  Banglore        625.0  650.0
1  Alice   30    London   60000    NaN  NaN       NaN          NaN    NaN
2    Bob   35     Paris   70000    NaN  NaN       NaN          NaN    NaN
3  Alice   28    London   55000   Emma    F   Chennai        784.0  812.0
4   John   22  New York   45000    NaN  NaN       NaN          NaN    NaN

**In a left join, all the rows from the left DataFrame (left_df) are included, and matching rows from the right DataFrame (right_df) are joined based on a common column. If there are no matches in the right DataFrame, the resulting rows will contain NaN values.**

In [38]:
right_df = pd.merge(data,df, on='Age', how='right')
right_df

  Name_x  Age      City   Salary  Name_y Sex   Address  Age_squared  Sum
0   John   25  New York  50000.0    John   M  Banglore          625  650
1  Alice   28    London  55000.0    Emma   F   Chennai          784  812
2    NaN   31       NaN      NaN   David   M   Gurgaon          961  992
3    NaN   24       NaN      NaN  Sophia   F    Mumbai          576  600

**In a right join, all the rows from the right DataFrame (right_df) are included, and matching rows from the left DataFrame (left_df) are joined based on a common column. If there are no matches in the left DataFrame, the resulting rows will contain NaN values.**

In [39]:
inner_df = pd.merge(data,df, on='Age', how='inner')
inner_df

  Name_x  Age      City  Salary Name_y Sex   Address  Age_squared  Sum
0   John   25  New York   50000   John   M  Banglore          625  650
1  Alice   28    London   55000   Emma   F   Chennai          784  812

**In an inner join, only the matching rows from both the left DataFrame (left_df) and the right DataFrame (right_df) are included based on a common column. Rows that do not have a match in both DataFrames are excluded from the result.**

In [40]:
outer_df = pd.merge(data,df, on='Age', how='outer')
outer_df

  Name_x  Age      City   Salary  Name_y  Sex   Address  Age_squared    Sum
0   John   25  New York  50000.0    John    M  Banglore        625.0  650.0
1  Alice   30    London  60000.0     NaN  NaN       NaN          NaN    NaN
2    Bob   35     Paris  70000.0     NaN  NaN       NaN          NaN    NaN
3  Alice   28    London  55000.0    Emma    F   Chennai        784.0  812.0
4   John   22  New York  45000.0     NaN  NaN       NaN          NaN    NaN
5    NaN   31       NaN      NaN   David    M   Gurgaon        961.0  992.0
6    NaN   24       NaN      NaN  Sophia    F    Mumbai        576.0  600.0

**In an outer join, all the rows from both the left DataFrame (left_df) and the right DataFrame (right_df) are included. Matching rows are joined based on a common column, and if there are no matches, the resulting rows will contain NaN values.**

### Q) What is the use of inplace=True parameter.

* inplace is a inbuild parameter in pandas which is used to manipulate the original dataset directly. For eg: we write a code that df.drop('column name', axis=1, inplace=True), which means it will drop that column permantly even in the original dataset.

### Q) How to find null values?

* By using df.isnull().sum()

### Q) How to drop a column in pandas?

* We use df.drop('column name', axis = 1, inplace = True)

### Q) How to unique values with their count?

df.value_counts()

### Q) How to compute median in pandas?

df.median()

### Q) How to compute mode in pamdas?
* By using df.mode() function, it will give mode of every column.

### Q) How to compute variance & standard deviation in pandas?

By using df.var() function we compute variance of all columns and by using df.std() function we compute standard deviation of all columns.

### Q) How to compute covariance and correlation in pandas?

* By using df.cov() function it will compute covariance and by using using df.corr('pearson') it will compute Pearson's coefficient Correlation and by using df.corr('spearman') it will compute Spearman's rank correlation.